/*
Сконструируйте классы и отношения, описывающие следующие объекты:
транспортное средство как таковое vehicle
велосипед bicycle
спортивный велосипед sport_bicycle
классический велосипед classic_bicycle
детский велосипед children_bicycle
автосредство automobile
легковая машина car
автобус bus
грузовик truck

Дальше на ваше усмотрение и фантазию!

Для данной архитектуры определите общие и различные признаки.
Постройте иерархию классов, определите виртуальные функции,
методы и поля классов.

Создайте класс человек, который сможет хранить гараж транспортных средств
и сможет ими пользоваться, обслуживать, смотреть технические характеристики.

Наполните свое приложение необходимыми экземплярами и
продемонстрируйте работу ваших классов.
*/

#include <iostream>

int main()
{
    std::cout << "Hello World!\n";
}
