#pragma once
class mystring
{
	//проектирование своего класса на подобии библиотеки string

	/*
	1) Создать конструктор по умолчанию, конструктор копирования
	2) Надо сделать операторы перегрузки: +, !=, ==, =, >=, <=, <, >, >>, <<
	3) Методы поиски строки в подстроке, также метод поиска символа
	4) Создать деструктор с удалением динамической памяти
	5) Нужны ли еще прочие методы, например высчитывание размера строки или использовать из iostream по умолчанию.
	6) добавить getline свой и как его реализовать?
	7) Добавить метод реверса
	8) добавить метод замены на заглавные слов после точки
	9) Добавить метод замены символов
	*/



};

