/*
Тема: STL часть 2

Задание.

Создайте приложение для работы автосалона. 
Необходимо хранить информацию о продаваемых автомобилях (название, год выпуска, объем двигателя, цену). 
Реализуйте интерфейс для добавления данных, удаления данных, отображения данных, 
сортировке данных по различным параметрам, поиску данных по различным параметрам.
При реализации используйте контейнеры, функторы и алгоритмы.

*/

#include <iostream>
#include<algorithm>
#include<vector>

using std::cin;
using std::cout;
using std::endl;
using std::string;
using std::vector;

int main()
{
    setlocale(LC_ALL, "ru");



    return 0;
}