/*
Домашнее задание СДБ 311. Домашнее задание от 02.03.2024
				Указатели
*/
/*
Задание 1:
Даны два массива: А[M] и B[N] (M и N вводятся с клавиатуры). 
Необходимо создать третий массив минимально возможного размера, 
в котором нужно собрать элементы массива A, которыене включаются в массив B, без повторений.

Задание 2:
Даны два массива: А[M] и B[N] (M и N вводятся с клавиатуры). 
Необходимо создать третий массив минимально возможного размера, 
в котором нужно собрать элементы массивов A и B, которые не являются общими д ля них, без повторений.

Задание 3:
Даны два массива: А[M] и B[N] (M и N вводятся с клавиатуры). 
Необходимо создать третий массив минимально возможного раз мера, 
в котором нужно собрать элементы обоих массивов.

Задание 4:
Даны два массива: А[M] и B[N] (M и N вводятся с клавиатуры). 
Необходимо создать третий массив минимально возможного раз мера, 
в котором нужно собрать общие элементы двух массивов без повторений.

Задание 5:
Дан массив: А[M] (M вводи тся с клавиатуры). 
Необходимо удалить из массива четные или нечетные значения. 
Пользователь вводит данные в массив, а также с помощью меню решает, что нужно удалить.

Задание 6:
Написать функцию, которая получает указатель на динамический массив и его размер. 
Функция должна удалить из массива все простые числа и вернуть указатель на новый динамический массив.

Задание 7:
Написать функцию, которая получает указатель на статический массив и его размер. 
Функция распределяет положительные, отрицательные и нулевые элементы в отдельные динамические массивы.
*/


#include <iostream>

int main()
{
    std::cout << "Hello World!\n";
}
