/*
Домашнее задание СДБ 311. Домашнее задание от 16.03.2024
				Структуры
*/

/*
Задание 3:
Разработайтепрограмму «Библиотека». Создайтеструктуру «Книга» ( название,автор, издательство, жанр).
Создайте массив из 10 книг. Реализуйте для него следующие возможности:
Редактировать книгу 
Печать всех книг 
Поиск книг по автору 
Поиск книги по названию 
Сортировка массива по наз ванию книг 
Сортировка массива по автору 
Сортировка массива по издательству
*/

#include <iostream>
#include <Windows.h>
#include <cstring>

int main()
{
	setlocale(LC_ALL, "ru");

    std::cout << "Hello World!\n";

	return 0;
}